Case8_TMS2015_AL_1mm_U50/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (1 0 0)
    (5 0 0)
    (9 0 0)
    (13 0 0)
    (13 1 0)
    (9 1 0)
    (9 2 0)
    (5 2 0)
    (5 3 0)
    (1 3 0)
    (1 2 0)
    (1 1 0)
    (0 1 0)
    (5 1 0)

    (0 0 5)
    (1 0 5)
    (5 0 5)
    (9 0 5)
    (13 0 5)
    (13 1 5)
    (9 1 5)
    (9 2 5)
    (5 2 5)
    (5 3 5)
    (1 3 5)
    (1 2 5)
    (1 1 5)
    (0 1 5)
    (5 1 5)
 
);

blocks
(
    hex (0 1 12 13 15 16 27 28) (10 10 50) simpleGrading (1 1 1)
    hex (1 2 14 12 16 17 29 27) (40 10 50) simpleGrading (1 1 1)
    hex (12 14 8 11 27 29 23 26) (40 10 50) simpleGrading (1 1 1)
    hex (11 8 9 10 26 23 24 25) (40 10 50) simpleGrading (1 1 1)
    hex (2 3 6 14 17 18 21 29) (40 10 50) simpleGrading (1 1 1)   
    hex (14 6 7 8 29 21 22 23) (40 10 50) simpleGrading (1 1 1)    
    hex (3 4 5 6 18 19 20 21) (40 10 50) simpleGrading (1 1 1)


);

edges
(
);

patches
(
        patch inlet
        (
           	(0 15 28 13)
        )

        patch outlet
        (
           	(11 26 25 10)
            (12 27 26 11)  
        )

        wall inletWall
         
        (
            (0 1 16 15)
            (13 12 27 28)
                   
        )
       wall lowerWall
        (
            
            (1 2 17 16)
            (2 3 18 17) 
            (3 4 19 18) 
                                  
        )

      wall stepWall
      (
            (4 19 20 5)  
            (6 21 22 7)
            (8 23 24 9)
                  
      )

      wall upperWall
         
        (
            (6 5 20 21)  
            (8 7 22 23)    
            (10 9 24 25)    
        )

       empty frontAndBack   //patch
        (
            (0 1 12 13)
            (1 2 14 12)
            (12 14 8 11)
            (11 8 9 10)
            (2 3 6 14)
            (14 6 7 8)
            (3 4 5 6)
           

            (15 16 27 28)
            (16 17 29 27)
            (27 29 23 26)
            (26 23 24 25)
            (17 18 21 29)
            (29 21 22 23)
            (18 19 20 21)
            

         )
 );

mergePatchPairs
(
);


// ************************************************************************* //
