Case8_TMS2015_AL_1mm_U50/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
        value           uniform 0;
    }

 

    inletWall
    {
        type             buoyantPressure;
        value           uniform 0;
   
    } 
   
    wall
    {
        type             buoyantPressure;
        value           uniform 0;
   
    }    
 
   
    walls
    {
        type             buoyantPressure;
        value           uniform 0;
   
    }    
 
obstacle
    {
        type             buoyantPressure;
        value           uniform 0;
   
    }    
 

    outlet
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1.4;
        value           uniform 0;
    }
    
}

// ************************************************************************* //
