Case8_TMS2015_AL_1mm_U50/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 933;
    }

    inletWall
    {
        type           fixedValue;
        value           uniform 300;
   
    }

    wall
    {
        type           fixedValue;
        value           uniform 300;
    }
    obstacle
    {
        type           fixedValue;
        value           uniform 300; //////
    }

    walls
    {
        type           fixedValue;
        value           uniform 300;
    }

    outlet
    {
        type            zeroGradient;

    }
    
}

// ************************************************************************* //
