Case8_TMS2015_AL_1mm_U50/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 3500; //29000
    }

    wall
    {
       type            epsilonWallFunction;
       Cmu             0.09;
       kappa           0.41;
       E               9.8;
       value           uniform 0.1;
    }
 
    obstacle
    {
       type            epsilonWallFunction;
       Cmu             0.09;
       kappa           0.41;
       E               9.8;
       value           uniform 0.1;
    }
    walls
    {
       type            epsilonWallFunction;
       Cmu             0.09;
       kappa           0.41;
       E               9.8;
       value           uniform 0.1;
    }
 
   inletWall
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
 

   outlet
    {
        type            inletOutlet;
   	    inletValue      uniform 0.1;
     	value           uniform 0.1;
    }
  
 
 
}


// ************************************************************************* //
