Case8_TMS2015_AL_1mm_U50/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.2;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 5.4; 
    }

    inletWall
    {
        type            kqRWallFunction;
        value           uniform .5;
    }
    obstacle
  {
        type            kqRWallFunction;
        value           uniform .5;
    }
     wall
    {
        type            kqRWallFunction;
        value           uniform .5;
    }
 
     walls
    {
        type            kqRWallFunction;
        value           uniform .5;
    }
 
 
   outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.21;
        value           uniform 0.21;
   }
 
}


// ************************************************************************* //
