Case8_TMS2015_AL_1mm_U50/0/nuSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-11;

boundaryField
{
 
    inlet
    {
        type            zeroGradient;
    }

    inletWall
    {
        type            zeroGradient;
    }
 
    wall
    {
        type            zeroGradient;
    }

    obstacle
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
 
   outlet
    {
        type            zeroGradient;
    }
 

   
}

// ************************************************************************* //
