Case8_TMS2015_AL_1mm_U50/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 -0 0);

boundaryField
{
    wall
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    walls
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    inletWall
    {
        type            calculated;
        value           nonuniform List<vector> 
300
(
(0 26.4047 -29.2932)
(0 17.4487 -12.6525)
(0 -108.222 48.1427)
(0 7.49474 -1.59603)
(0 45.6981 -0.00208805)
(0 40.9392 8.72348)
(0 21.1356 9.43329)
(0 -95.5132 -69.4397)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
}


// ************************************************************************* //
