Case8_TMS2015_AL_1mm_U50/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.01;
    format          ascii;

    case            "example";
    instance        "system";
    local           "";

    class           dictionary;
    object          funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
	init
	{ 
		field alpha1;
		expression "0";
		keepPatches true;
	}
	setGamma
	{
		field alpha1;
		expression "1";
		condition "pos().x < 0 && pos().y > -3";
		keepPatches true;
	}
 
);


// ************************************************************************* //
